<!DOCTYPE html>
<html lang='ru'>
<head>
    <title>Простейший PHP-сценарий</title>
    <meta charset='utf-8'>
</head>
<body>
<h1>Здравствуйте!</h1>

<?php
// Вычисляем текущую дату в формате "день.месяц год"
$dat = date("d.m.Y");
// Вычисляем текущее время
$tm = date("H:i:s");
# Выводим их
echo "<p>Текущая дата: $dat года</p>\n";
echo "<p>Текущее время: $tm</p>\n";
# Выводим цифры
echo "<p>А вот квадраты и кубы первых 5 натуральных чисел:</p>\n";
echo "<p><ul>\n";
for ($i = 1; $i <= 5; $i++) {
    echo "<li>$i в квадрате = " . ($i ** 2);
    echo ", $i в кубе = " . pow($i, 3) . "</li>\n";
}
?>

</ul></p>
</body>
</html>

<?php

// =====================================================================================================================

const BR = '<br>';
const HR = '<hr>';

## Ссылки на объекты.
// Объявляем новый класс.
class AgentSmith
{
}

// Создаем новый объект класса AgentSmith.
$first = new AgentSmith();
// Присваиваем значение атрибуту класса.
$first->mind = 0.123;
// Копируем объекты.
$second = $first;
// Изменяем "разумность" у копии!
$second->mind = 100;
// Выводим оба значения.
echo "First mind: {$first->mind}, second: {$second->mind}";


echo BR;
echo HR;
// =====================================================================================================================

$a = ['a' => 'apple', 'b' => 'banana', 'c' => ['x', 'y', 'z']];

var_dump($a);

echo BR;

$a = [1, ["a", "b"]];

var_dump($a);

echo BR;
echo HR;
// =====================================================================================================================

## Использование var_export().
class SomeClass
{
    private $x = 100;
}

$a = [1, ["Programs hacking programs. Why?", "д'Артеньян"]];
echo "<pre>";
var_export($a);
echo "</pre>";
$obj = new SomeClass();
echo "<pre>";
var_export($obj);
echo "</pre>";

echo BR;
echo HR;
// =====================================================================================================================


## Логические переменные
$hundred = 100;
if ($hundred == 1) {
    echo "хм, странно... переменная равна 1!<br />";
}
if ($hundred == true) {
    echo "переменная истинна!<br />";
}

echo BR;
echo HR;
// =====================================================================================================================


## Операторы равенства и эквивалентности.
$yep = ["hello", "world"];
$nein = ["hello", true];
if ($yep == $nein) {
    echo 'они равны';
} else {
    echo 'net';
}

echo BR;
echo HR;
// =====================================================================================================================

## Сравнение объектов.
class AgentS
{
}

$smit = new AgentS();
$wesson = new AgentS();
if ($smit == $wesson) {
    echo 'ravno ==';
} else {
    echo 'net ne ==';
}

echo BR;

if ($smit === $wesson) {
    echo 'ravno ==';
} else {
    echo 'net ne ===';
}

echo BR;
echo HR;
// =====================================================================================================================

$arr = [6, 4, 8, 3, 9, 1, 5];
usort($arr, function ($a, $b) {
    return $a <=> $b;
});
var_dump($arr);
























